{
    "class_name": "Functional",
    "config": {
        "name": "model_5",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        256,
                        256,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Functional",
                "config": {
                    "name": "model",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    256,
                                    256,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_2"
                            },
                            "name": "input_2",
                            "inbound_nodes": []
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_1",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_1",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_1",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "activation",
                            "inbound_nodes": [
                                [
                                    [
                                        "batch_normalization_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_2",
                            "inbound_nodes": [
                                [
                                    [
                                        "activation",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_2",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_2",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "TFOpLambda",
                            "config": {
                                "name": "tf.__operators__.add",
                                "trainable": true,
                                "dtype": "float32",
                                "function": "__operators__.add"
                            },
                            "name": "tf.__operators__.add",
                            "inbound_nodes": [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {
                                        "y": [
                                            "batch_normalization",
                                            0,
                                            0
                                        ],
                                        "name": null
                                    }
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_1",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "activation_1",
                            "inbound_nodes": [
                                [
                                    [
                                        "tf.__operators__.add",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        }
                    ],
                    "input_layers": [
                        [
                            "input_2",
                            0,
                            0
                        ]
                    ],
                    "output_layers": [
                        [
                            "activation_1",
                            0,
                            0
                        ]
                    ]
                },
                "name": "model",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "max_pooling2d",
                "inbound_nodes": [
                    [
                        [
                            "model",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Functional",
                "config": {
                    "name": "model_1",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    128,
                                    128,
                                    16
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_3"
                            },
                            "name": "input_3",
                            "inbound_nodes": []
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_4",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_4",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_3",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_4",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_4",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_4",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_2",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "activation_2",
                            "inbound_nodes": [
                                [
                                    [
                                        "batch_normalization_4",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_5",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_5",
                            "inbound_nodes": [
                                [
                                    [
                                        "activation_2",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_3",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_3",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_3",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_5",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_5",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_5",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_3",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_3",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_3",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "TFOpLambda",
                            "config": {
                                "name": "tf.__operators__.add_1",
                                "trainable": true,
                                "dtype": "float32",
                                "function": "__operators__.add"
                            },
                            "name": "tf.__operators__.add_1",
                            "inbound_nodes": [
                                [
                                    "batch_normalization_5",
                                    0,
                                    0,
                                    {
                                        "y": [
                                            "batch_normalization_3",
                                            0,
                                            0
                                        ],
                                        "name": null
                                    }
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_3",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "activation_3",
                            "inbound_nodes": [
                                [
                                    [
                                        "tf.__operators__.add_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        }
                    ],
                    "input_layers": [
                        [
                            "input_3",
                            0,
                            0
                        ]
                    ],
                    "output_layers": [
                        [
                            "activation_3",
                            0,
                            0
                        ]
                    ]
                },
                "name": "model_1",
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "name": "max_pooling2d_1",
                "inbound_nodes": [
                    [
                        [
                            "model_1",
                            1,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Functional",
                "config": {
                    "name": "model_2",
                    "layers": [
                        {
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    64,
                                    64,
                                    32
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "ragged": false,
                                "name": "input_4"
                            },
                            "name": "input_4",
                            "inbound_nodes": []
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_7",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_7",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_4",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_7",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            },
                            "name": "batch_normalization_7",
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_7",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_4",
                                "trainable": true,
                                "dtype": "float32",
                                "activation": "relu"
                            },
                            "name": "activation_4",
                            "inbound_nodes": [
                                [
                                    [
                                        "batch_normalization_7",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_8",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "relu",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_8",
                            "inbound_nodes": [
                                [
                                    [
                                        "activation_4",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_6",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "HeUniform",
                                    "config": {
                                        "seed": 42
                                    },
                                    "shared_object_id": 2
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "name": "conv2d_6",
                            "inbound_nodes": [
                                [
                                    [
                                        "input_4",
                                        0,
                                        0,
                                        {}
